[
  {
    "section": "Art",
    "classes": [
      {
        "comments": [],
        "description": "Mixed Media is a one-semester course in which students will build upon skills learned in Art Appreciation to complete 4-5 studio art projects. Students will explore various mediums of art such as sculpturing, painting, colleges, and more as they create their own mixed-media works of art. Students will also explore the history of both modern and contemporary mixed-media art. Class trips to galleries or museum exhibits to write personal reviews can also be expected in this course. A final portfolio review and critique will occur at the end of the semester.",
        "name": "Mixed Media",
        "periods": "N/A",
        "prereqs": "Sophomore/Junior/Senior",
        "teacher": "N/A"
      }
    ]
  },
  {
    "section": "Biology",
    "classes": [
      {
        "comments": [
          "Her classes are pretty boring. (everyone pulls out their laptops to work on something else) she tries her best to be funny but I don't think any of the jokes land very well.",
          "The way she usually teaches is just reading off her slides and asking some questions. She'll spend a good chunk of class everyday going over the exact same slides from the previous day",
          "She doesn't usually assign too much homework (we've only had 8 hw assignments from the beginning of the year until now) and the hw she does assign is usually just read a chapter from the textbook, define a few vocab words, and answer some questions. she gives a good amount of time for each hw assignment.",
          "Her exams are generally all multiple choice questions (some of them are true and false questions or matching vocab to the definition) and occasionally she has \"essay questions\" (literally the exact same questions she asks for hw and you don't have to write more than like a paragraph for them).",
          "I would say her exams aren't extremely difficult but sometimes the questions she asks are a bit obscure (for her second exam, she asked like 5 questions on this random short anthropological account in the middle of a textbook chapter. the questions were like \"what was the researcher's name? which organization were they sponsored by?\")",
          "A majority of the extra out-of-textbook material and vocab she covers does not show up on the exam"
        ],
        "description": "This course encompasses 3 fields of anthropology: Paleontology and the Evolution of Humans, Archaeology and Cultural Anthropology.Two seminal questions will be proposed to the class at the end of the course- What does it mean to be human? and What would happen to human culture and history if all the indigenous cultures of the world were to disappear and would you care? Assignments will include readings of seminal works in the field, field trips to local museums, a research paper and student group presentations.",
        "name": "Anthropology",
        "periods": "2",
        "prereqs": "Sophomore/Junior/Senior",
        "teacher": "Fong"
      },
      {
        "comments": [
          "Citron in APES: Citron is a super funny and chill guy, and most of his classes are lecture or problem solving styled. He preps you pretty decent for the APES Exam, but his exams are quite challenging, so getting 90s on them is quite a struggle. But 1st sem, he gave us test corrections which brought 40 to 50 percent of our grades, and in 2nd sem, he gave projects and ec opportunities so if you work hard, high 90s is not such a big deal. Also, if you raise your hand frequently, he gives you +1 for your overall gpa. Overall, you will enjoy his class a lot.",
          "Citron in APES: Citron is such a god. He is passionate about what he teaches and he loves to joke with you. His tests are hard and his workload is a lot but he makes sure he prepares you for the AP (APES exam).",
          "Citron in Human Pathophysiology: I loved this class so much omg. I love Citron so much he's such a wonderful and engaging teacher. The workload really isn't that bad, most of the homework is just relatively short Edpuzzles. It focuses on emergency medicine because he used to be a medic in the Bronx so he teaches you all about the injuries you might see, how they work, how the affected organ should function, and how to fix it. Also, before the tests he gives you a list of possible questions/topics which is really really nice. If you're interested in medicine in any capacity I would definitely recommend it!!! And even if you're not, it can be useful information, you just might not find it as interesting I guess. He's also just a really understanding teacher like if you come to him with a problem, he tries his best to help you. When I had COVID in October, he emailed me asking if I wanted to meet after school days over zoom so he could catch me up it was very sweet and very helpful :,) I'm gonna admit that he can be a little disorganized in terms of grading though, but the pros heavily outweigh the cons in my opinion."
        ],
        "description": "Understanding Health and Disease is an essential semester-long course where students decode the intricate mechanisms behind various medical conditions. Core competencies empower students to analyze disruptions in the body's functioning, covering cellular dysfunction, organ systems, and the interplay of genetic and environmental factors in disease. Through hands-on case studies, students gain practical insights and analytical skills, preparing them to make informed decisions in healthcare. This course provides a concise exploration of the dynamic field of pathophysiology, emphasizing real-world applications and critical thinking.",
        "name": "Human Diseases",
        "periods": "N/A, Likely 3/4",
        "prereqs": "Junior/Senior",
        "teacher": "Citron"
      },
      {
        "comments": [
          "I wouldn't recommend taking Econome's class for cancer research. He often forgets to upload assignments on time, and the work can be tedious. The grading is slow, and after three months, only four assignments have been graded. The lessons aren't the best for learning, as the slides don't match the points he makes. The projects, like a case study and report on a science article, aren't fun for me. Plus, Econome can get upset easily. Only take it if you're really passionate about the subject, otherwise, it's not worth the trouble.",
          "He's super disorganized",
          "He gives weekly quizzes"
        ],
        "description": "Students will learn cutting-edge research strategies from basic discovery through clinical trial drug studies. Students will perform their own cancer-based experiments , read engaging case studies and professional publication, apply to summer research programs",
        "name": "Cancer Research",
        "periods": "N/A, Likely 5/6",
        "prereqs": "Junior/Seniors",
        "teacher": "Econome"
      },
      {
        "comments": [
          "Student Comment(s):",
          "Dr. Ned teaches medical human genetics. The class was pretty annoying imo. You have to write a really long paper on curing a disease which reaches around 15-20 pages long. The tests aren't really that bad but the class was a lot of work for an elective. If you like bio, it is worth a shot but I liked bio going into it and I still hated the class."
        ],
        "description": "Explore the Blueprint of Life in this dynamic semester-long course. Dive into DNA, genes, and heredity, and engage in experiments with cutting-edge genetic research techniques. From Mendelian genetics to CRISPR gene editing, discover the latest advancements and contribute to ongoing research projects. Gain practical experience in genetic analysis, bioinformatics, and effective communication of research findings.",
        "name": "Medical Human Genetics",
        "periods": "N/A, Likely 6/7",
        "prereqs": "Junior/Senior",
        "teacher": "Ned"
      },
      {
        "comments": [
          "Geology is pretty boring but a lot of classes are just watching documentaries so it's chill, just make sure you actually do hw and study the rocks and stuff and pass the tests.",
          "If you need a free 90 plus take it, but there is a lot of work like he assigns readings and Edpuzzles but the score you get on them doesn't matter. As long as you always submit something he will give you a 90+ in the end.",
          "Very bad with following policies on testing.",
          "Assessments - Exams, homework, readings, lab practicals on rock and minerals, field trips, recorded observations in a field guide notebook."
        ],
        "description": "This course focuses on the forces that have shaped our physical planet.",
        "name": "Geology",
        "periods": "N/A, Likely 7/8",
        "prereqs": "Junior/Senior",
        "teacher": "McClellan"
      },
      {
        "comments": [
          "I loved Urban Ecology. I took it my fall semester of sophomore year when we were still in school. It was my favorite class sophomore year. Ms. Maggio teaches it and she's incredible. Such an interesting and applicable and interdisciplinary class, really inspired my love of environmental studies and environmental engineering. Because it's studying the ecology and environments of cities, part of the class was actually field trips (I think the requirement was to go to 8!). I even went camping for that class (so worthwhile)! You learn so much, and Ms. Maggio structures it in such a comprehensive way, from papers to discussions to projects to trips to presentations to actually building a model greenhouse. That being said, it's a lot of work. Like a lot. But you get quite a lot out of it and if you work diligently your grade should be just fine.",
          "Assessments - Exams, homework, literature review of a topic related to urban ecology, powerpoint presentations, field trips, active class participation."
        ],
        "description": "Humans are the epitome of an organism that modifies its environment for its own use. The outcomes of our modifications include the creation of cities and their associated infrastructure, impoundments, utilities, etc. Urban Ecology is the study of how people in suburbs and cities interact with their environment. These interactions take many different forms such as economics, psychology, biology, sociology, geography, and public policy.",
        "name": "Urban Ecology",
        "periods": "10",
        "prereqs": "Junior/Senior",
        "teacher": "Maggio"
      }
    ]
  },
  {
    "section": "Chemistry",
    "classes": [
      {
        "comments": [
          "Paik is nice but may be picky when grading. She is a good teacher and ensures that students are learning well.",
          "Had Paik for advanced chem lab junior year. The class is a series of 9 labs, with two quizzes after each lab: quantitative and qualitative quizzes. If you're good at math, the quantitative quizzes are a grade booster, and if you're good at understanding the niche procedures in the lab, then the qualitative quizzes are much better. Paik is very nitpicky about labeling your lab sheet, so make sure to ask her multiple times if you don't get a procedure or what she wants on the lab sheet, because in the end if you don't ask it could cost you easy points. Whenever we have HW, it is usually less than 20 mins. Paik drops the lowest lab report, qualitative quiz, and quantitative quiz, so don't fret. For the second term seniors who may take the course, please don't catch on fire with the Bunsen Burner (be careful!), and do study for your quizzes, even if it is a little bit a day, because a missed or bad quiz can wipe your average severely.",
          "Pluchino is nice and understanding. She is willing to answer questions and lenient with deadlines if brought up with her."
        ],
        "description": "Advanced Chemistry Lab is a one-term course designed to introduce students to laboratory techniques in the chemistry laboratory. During the course, the students will learn about health and safety issues, the preparation and use of common glassware/lab equipment, proper recording of qualitative and quantitative observations and common laboratory techniques. In addition to working in the chemistry laboratory, the students will learn how to write full laboratory reports, analyze data, draw valid conclusions based on the data collected and perform error analysis.",
        "name": "Advanced Chemistry Lab",
        "periods": "6, 7, 8",
        "prereqs": "Passed chemistry",
        "teacher": "Paik, Pluchino"
      }
    ]
  },
  {
    "section": "English",
    "classes": [
      {
        "comments": [
          "Ms. Mazzurco is nice, but the course and discussions felt very surface level. The homework is usually just reading and annotating",
          "I'm taking Existentialism now and I enjoy it a lot - don't take it if you don't like talking in depth about morals and stuff. The reading can be dense because people didn't like to proofread, but the class is chill overall!",
          "Out of Existentialism, Creative Nonfiction, and Sci-Fi, I think Existentialism was the hardest but it was also my favorite. I think it's especially great if you're religious since Existentialism is usually an atheist philosophy so it's a great chance to see different perspectives and how they're the same or different from yours.",
          "Existentialism is a good class. If you're someone striving to get 95+ in the class, that'll be difficult, but 90+ should be more than manageable. I took it as a senior, and I just sat back, relaxed (did all the work without stressing about grades), and learned a lot. Existentialism gives you a few new perspectives to see life through, and it's quite fascinating."
        ],
        "description": "Existentialism is a single-semester selective that stresses fervent individualism in the face of an irrational universe. It, along with Absurdism, uplifts the \"rebel,\" that individual who is courageous enough to rise above codified existence and live authentically. These writers express themselves with a passionate sense of urgency: calling for a revolt against programmed behavior, exposing the dangers of falling into conformity and \"everydayness,\" and highlighting the importance of embracing one's own subjective experience of existence. These writers want us to deeply consider the nature and nuance of individual agency and free will. Most existential / absurd writers write out of a profound experience, the sort of experience that they believe gives them a brief moment of insight into the human condition. They often use fiction as a vehicle to relay this experience. Our job is to find this fundamental revelation behind the text and try to relate to it. You will often hear me ask, \"What experience does the author reveal to us? How does this connect to existentialism and to your own experiences?\" Students can expect to read the following literary works: No Exit (1944) and The Flies (1943) by Jean-Paul Sartre, Notes from Underground (1865) by Fyodor Dostoevsky, The Stranger (1942) by Albert Camus, Waiting for Godot (1948) by Samuel Beckett, and The Trial (1914-1917) by Franz Kafka. The course will also focus on the main philosophical essays of this discipline along with a few postmodern essays on ideology. Students will be asked to complete a series of response papers that will hopefully culminate into a brief philosophical manifesto. These response papers will be personal in nature and use textual references to propel the essay's central argument. The course is broken up into four main problems: 1) Other People, 2) Free Will and Ethical Action, 3) Ideology and Identity, 4) Nothingness and Happiness, or Absurdism.",
        "name": "Existentialism (Core)",
        "periods": "3, 6",
        "prereqs": "Seniors, did not already take class",
        "teacher": "Mazzurco"
      },
      {
        "comments": [
          "I swear Acting is the best class to take as a second semester senior. There's essentially no writing assignments. You get to play acting games and rehearse two scenes for the entire semester. Grades range between 90-95 but honestly at that point, do grades even matter? Best and easiest english class ever",
          "Acting is fun but you have to be willing to push yourself out of your comfort zone cause Ms. Sheinman will definitely do that for you if you don't. There's like no homework ever, but you have to participate.",
          "It's a very fun class! It's really chill and there's almost no work outside of two plays we have to memorize (but you'll get plenty of time to memorize, like 3-5 weeks I think). On top of that, there are trips to Broadway shows and acting games! The only thing is that Sheinman won't like you if you skip... it's also a class where everyone has to participate, so if you hide in the corner you're going to get called. You could say it's heavily participation based... it'd make an epic 2nd semester senior english class!"
        ],
        "description": "This one-semester course focuses on the art of acting. We will read plays from a variety of genres, such as the Neil Simon classic comedy The Odd Couple, the great American tragedy Death of a Salesman by Arthur Miller, Angels in America by Tony Kushner, and at least one of Shakespeare's plays. Students need not have acting experience, but must be willing to participate each day and to take emotional risks. We will also schedule several trips to the theater - but please do not take this class if your main goal is to see free Broadway shows. Written assignments will include character analyses, play reviews, and critiques of classmates' performances. You will be required to fully memorize and perform two or three scenes of approximately twelve minutes apiece. After receiving feedback, you will perform the scenes again, expanding your characterization and adding more depth to your performances. To enroll in the class students must have at least an 85% English average. Excellent attendance is mandatory, as is the ability to work collaboratively and supportively with classmates. The goals of the class include instilling a genuine love of performance, fostering a greater understanding and appreciation of acting, and inspiring every student to make the theater a part of their future.",
        "name": "Acting",
        "periods": "8, 9",
        "prereqs": "Seniors, did not already take class",
        "teacher": "Sheinman"
      },
      {
        "comments": [
          "Creative Nonfiction is a very easy class to finesse, but if you genuinely try to get something out of it, you definitely will. Ms. Pohan gives great prompts that make you reflect on your life, and if you tackle them with genuine intention, you can get a lot out of the class. The class also has pretty much no homework.",
          "It's a wonderful class, quite fulfilling if you're trying to develop any expressive writing skills (I was). It is about writing about things that you've experienced, but writing it creatively and expressively (hence the term \"creative nonfiction\"). creative writing, mixed with personal experiences. would be a great class for learning some college essay skills (but I assume you'll be past that by the time you take the class).",
          "I highly recommend creative nonfiction. Ms. Pohan is very nice, very chill class and great to get to know your classmates. Class is mostly writing with some discussions and readings. You do 3 essays and class ends with a chapbook project (revise your essays, write a 4th one, compile them into a book and present them to the class)."
        ],
        "description": "Creative Nonfiction is the ideal setting for students who want to continue nurturing their writing practice as well as students who are curious about what writing might look like beyond traditional academic structures. While most of the writing is based on the \"self\", as personal essayists students will have freedom to choose their subjects as they experiment with and hone their style. The time is split evenly between teacher-led instruction, self-driven practice, and collaborative peer work as we make our way through four major units: Narrative Personal Essay, Essay of Place, Essay of Definition, and Essay of Choice. Sharing Days provide opportunities to read aloud finished pieces as well as try out works in progress. While much of the reading is done in class, the expectation is that writing and revising are always happening beyond the classroom. Students in this workshop are accountable not only to themselves but to each other, and in the end, each will work in a small group as they finalize and publish their body of work, complete with Artist's Statement and blurbs from their peers.",
        "name": "Creative Nonfiction",
        "periods": "2, 7, 8",
        "prereqs": "Seniors, did not already take class",
        "teacher": "Pohan"
      },
      {
        "comments": [
          "What are the core components of a story?",
          "What methods and materials do theater makers use to tell stories?",
          "What kinds of stories get told on stage? Who is represented? What conflicts are investigated? What counts as resolution?",
          "What opportunities does live performance afford? What challenges does it present? What risks does it pose? What feelings should it inspire?",
          "How can performing help us understand stories and texts? How can we use performance to develop and communicate our interpretation of stories and texts?",
          "Crutchfield",
          "Student Comment(s) [about Crutchfield in general]:",
          "Ms. Crutchfield is a wonderfully amazing teacher. Or at least I personally loved her way of teaching and her class. If you love English and care about composition class then you will absolutely love her class. But if you just don't care, then you will be in for a kind of rough time. She is very helpful, kind, caring, and loves it when you talk to her about the things in class. She does have a few of her annoying things like name quizzes on classmates, and she also does a whole unit on grammar, but you really like her most certainly. She also really emphasizes on the importance of composition assignments in her class and she also grades them very harshly. However, she is very willing to spend a bit of time after class with you if you have questions or confusion about any of her assignments.",
          "Crutchfield is a very understanding teacher and is super nice. Just don't push her too much or she might get scary. Besides that, she cares a ton about her students and her feedback is very thorough. As long as you put in the necessary effort, it will show. You will probably not get super high grades, maybe low-mid 90's, and sometimes classes will get boring. However, she does teach some really good stuff like her grammar unit and she doesn't do things like minutes or Romeo and Juliet.",
          "I'm struggling to remember specifics but I had Ms. Crutchfield for Freshman Composition for part of the second semester and I personally enjoyed the class. We read one of my favorite books that year and I think the essay prompts were pretty interesting. I think she was a slightly harsher grader than some of the other English teachers I've had but I remember her feedback being really good and specific, so I think you can do well in the class if you participate and try. I think we also had a few class seminars to discuss some of the books."
        ],
        "description": "What makes theater exciting? What makes it dangerous? What does performance offer that reading does not? This course will explore how theater makers of different cultures and eras have answered these questions as we study the structure of stories and the tools we use to tell them on stage. As we read theatrical works and historical sources from diverse but connected traditions, we will consider the role of costume, mask and makeup, movement, and stage space in establishing character, developing plot, and evoking emotion. Students will learn to think like performers, producers, and critics; assessments will include performances, creative projects, and written reflections. This is a course for students who are interested in theater, history, or storytelling in any medium. Works studied may be drawn from traditions including classical Greek tragedy, feudal Japanese nō, Yuan Dynasty zaju, 17th-century French and Spanish drama, 19th-century Italian opera, and 20th-century movements including realism, epic (Brechtian) drama, post-colonialism, and devised theater.\nEssential Questions:\nWhat are the core components of a story?\nWhat methods and materials do theater makers use to tell stories?\nWhat kinds of stories get told on stage? Who is represented? What conflicts are investigated? What counts as resolution?\nWhat opportunities does live performance afford? What challenges does it present? What risks does it pose? What feelings should it inspire?\nHow can performing help us understand stories and texts? How can we use performance to develop and communicate our interpretation of stories and texts?",
        "name": "Stories on Stage",
        "periods": "N/A",
        "prereqs": "Juniors/Seniors, did not already take class",
        "teacher": "Crutchfield"
      },
      {
        "comments": [
          "I loved Writing to Make Change! I thought the workload was manageable (a little tedious and definitely heavier in comparison to other English electives like poetry or acting) and Ms. Thoms is very accommodating with deadlines as long as you communicate with her. She's really sweet and organized and she grades on the lighter side, in my opinion. There's a lot of freedom in terms of writing, especially since you choose the subjects you want to research. As long as you participate and complete the work, it's not too difficult to get a 95+ in the class (though that also depends on your writing ability).",
          "I have Writing to Make Change, and it is an amazing class. I chose it because I had Ms. Thoms during freshman year, and she is one of the nicest people I've ever met. Although the class itself may not be as challenging compared to APENG or American Literature, there are still engaging ways to write essays. Plus, your piece doesn't need to be an essay; it can be anything including comics, poetry, videos, songs, etc. You might have a field trip as well, since we went to the Museum of Natural History, and Ms. Thoms also hosts a lot of guest speakers, and we recently had a guy who interviewed George Martin (guy who wrote Game of Thrones) and wrote comics for Marvel and Star Wars. Overall, the class is really fun and if you are interested in freely expressing your perspectives on personal/social issues, WMC is a perfect option. It is so worth taking."
        ],
        "description": "Much of the writing we do in English classes is for an audience of one: the teacher. The focus of this writing workshop course will be to generate and craft public writing for a larger audience: writing that moves beyond the classroom, and even beyond the walls of the school. In the first third of the course, we will study writing in a variety of genres, including personal essay/memoir, fiction, drama, op-eds, poetry, and the graphic novel/the infographic. We will write in response to invitations, identifying issues we are passionate about, and forms - including hybrid forms - we are eager to explore. In the second part of the course, students will identify their pressing issue and the audience they want to address, and embark on an independent study researching what has been written about that issue and determining what they will add to this conversation. Each student will write up a proposal for their final project: a piece of public writing that will go out into the world to make change. The final weeks of the course will be devoted to developing, drafting, and revising pieces for publication. By the end of the semester, each student will take action by putting their writing out into the world through publication, contest submission, performance, or some other means. This writing workshop class will be open to juniors and seniors as an English selective.",
        "name": "Writing to Make Change",
        "periods": "5, 6",
        "prereqs": "Seniors, did not already take class",
        "teacher": "Thoms"
      },
      {
        "comments": [
          "POETRY is heaven sent. I love Dr. Moore and I love her class. Light workload and she's very kind & loves to see you grow in your writing throughout the semester.",
          "Poetry is amazing !! Generally very light and I have zero regrets taking it. Dr Moore is a blessing and she's consistently very supportive <33 it's really easy to do well and it's a great place for writers who wanna work on their individuality.",
          "Poetry is one of the best classes I've taken at Stuy. Dr Moore is the sweetest woman!! Not a lot of hw, and we do a lot of our writing in class! We do have to do poem recitations every once in a while, but I don't think that's much of a problem.",
          "Tip: Sign up for minutes on Thursdays or Mondays because Wednesdays/Fridays are workshop/sharing days so no notes are needed."
        ],
        "description": "This course incorporates the study of poetry with the writing of poetry. We'll begin with some contemporary writers, explore rhythm, rhyme, and the complex forms, particularly those from Asia and the Middle East, take two weeks to experiment with risks and new approaches, jump back in time to study several of America's most celebrated voices, and close with a unit on spoken word. Along the way we'll study poets ranging from Walt Whitman to Aimee Nezhukumatathil, Emily Dickinson to Jason Koo. We'll also look closely at two full books by John Yau and Claudia Rankine as we imagine what our own final collections might look like. Perhaps most importantly, we'll be focusing on your writing and the writing of your classmates past and present. As my former student Disi Chen once wrote, \"This is not only a class where you write to express but also listen to learn. You'll be surprised when you hear the poetry of others and realize that everyone has so much to say in so many different styles, you included.\" Most Wednesdays will be devoted to workshops, and most Fridays will involve readings or recitations. Seven times during the course of the semester, I will comment on individual poems, and at the end of the term you will have an opportunity to collect and present your ten best poems in a chapbook. Three times during the course of the semester, you'll memorize and recite a poem of your choice that is over twelve lines.",
        "name": "Poetry",
        "periods": "2, 9, 10",
        "prereqs": "Seniors, did not already take class",
        "teacher": "Moore"
      },
      {
        "comments": [
          "One of the best English classes I have taken at Stuy. Even though the course name that shows up on Talos and the course list is \"Science Fiction,\" keep in mind that this course deals both with the science fiction and fantasy genres. We get to read a lot of interesting short stories and novels, evenly distributed across sci-fi and fantasy. The class overall is very chill, and homework is mostly reading plus a little annotation on post-its. Staley is a wonderful teacher and super passionate about sci-fi and fantasy. He is also a light grader on writing assignments. 10/10 recommended!"
        ],
        "description": "In this course, you will be exposed primarily to works which deal with the scientific and technological ingenuity of man (the science fiction genre) and to works which deal with magic and the supernatural (the fantasy genre). It is worth noting that these two genres often overlap, and are frequently subsumed under the umbrella term \"speculative fiction\" (or \"SF\"), which also includes superhero fiction, horror, utopian/dystopian fiction, and so on. (So we are likely to read some of that stuff too.) We will spend the first part of the semester exploring the history of these genres, looking at classic, canonical examples and trying to develop a working vocabulary: what makes a story an example of science fiction or fantasy? What are the key features of these sorts of texts? How have the genres evolved (or stagnated)? We will then move on to look at more diverse, contemporary examples, focusing especially on works that in some way challenge or play with the conventions we saw in the classic texts. In addition to reading and analyzing traditional texts (short stories and novels), we will also examine the range of other media in which science fiction and fantasy stories have been told, from film and television to comic books and video games. The semester will culminate in a creative project, where you will create your own work of science fiction or fantasy in a medium of your choice.",
        "name": "Science Fiction",
        "periods": "6, 7",
        "prereqs": "Seniors who did not take the class already",
        "teacher": "Staley"
      },
      {
        "comments": [
          "It's pretty fun if you like performing, but there is an expectation of doing research and/or line analysis for projects and performances. overall more focus on performing than other literature classes, but in the end still a literature class. I enjoy the class a lot though, Coleman is super down-to-earth and funny.",
          "It's a very light English class compared to others. Shakespeare lingo is still a bit confusing for me but there aren't any writing assignments so I'm bingchilling. You often have choices on what you want to do for a project, which can be scene performance (memorizing lines and acting on stage), research, or design. The class generally has a low amount of students so acting in front of others isn't as stressful. Coleman is very nice and I highly recommend it."
        ],
        "description": "While we will read, discuss and analyze the plays of Shakespeare in a traditional manner, this class will primarily center around performance. And while it is great to understand and analyze Shakespeare's characters and language, we do feel your understanding of his plays can be deepened by being on your feet, reading lines aloud, and acting out key scenes. Consequently, while students should expect significant reading and writing assignments, much of the work this semester will be done in class. Through read-outs, recitations, small group assignments and full-length performances, we will have lots of fun bringing the works of Shakespeare to life. Furthermore, we do want you to take risks and to move out of your comfort zone in this course. Therefore, it is imperative that this environment feels supportive and encouraging - especially for those of us who are shy and might have some stage fright. Consequently, building a strong, fun and creative classroom community is essential to achieving this.",
        "name": "Shakespearean Literature (Core)",
        "periods": "1, 2",
        "prereqs": "Seniors who did not take the class already",
        "teacher": "Coleman"
      },
      {
        "comments": [
          "I had Kincaid for Freshman Comp and she was SO disorganized. She forgot to turn in our grades on time and she barely leaves any comments on your essays.",
          "Kincaid is high key a free period. She did karaoke every Friday.",
          "Garfinkel is a really great person and teacher. He's very understanding and generous with deadlines.",
          "Garfinkel is a quirky guy - his comments on your essays will improve your writing but also make you question yourself as a writer. Definitely participate & make insightful comments.",
          "As for Mandler, he's a good teacher, and pretty entertaining not gonna lie. He values participation a lot so just make sure to stay active in class discussions. The majority of class during remote was breakout room discussions, so just keep an active discussion going and your participation grade should be nice. As for homework, we had to write some responses but he doesn't grade too harshly on that, so just stay on top of the reading.",
          "Mandler is wonderful and you get genuinely interesting essay assignments. The annoying thing is that iirc he's the only teacher in the english dept who gives tests as well as essays, but honestly they're not too difficult.",
          "Pavano is a nice teacher. He talks a lot but gives unannounced reading quizzes. Discussion questions are nuanced half the time."
        ],
        "description": "The one-semester course includes literature that expands upon the European and American traditions of sophomore and junior years, and writing assignments that prompt seniors to reflect upon their four years at Stuyvesant and to look towards college and beyond. During the semester, students will read major works of literature that enter into conversation with each other and with historical events. While some of the works studied may revisit the European and American canons of sophomore and junior year, syllabi will focus on works from beyond Europe and America, and much of the literature will move beyond the canon. Students will write pieces that ask them to join the larger academic and cultural conversations of our time, from college-level academic writing to other forms that exist outside of academia. Seniors taking the class in the fall term will complete a personal/college essay as a first assignment; seniors taking the class in the spring will complete a comprehensive culminating assignment that prompts them to reflect on the semester and/or their years at Stuyvesant.",
        "name": "Writing in the World (Core)",
        "periods": "1, 3, 4, 5, 6, 7, 9, 10",
        "prereqs": "Seniors",
        "teacher": "Pavano, Kincaid, Mandler, Garfinkel"
      },
      {
        "comments": [
          "Women's Voices is an interesting class with Mr. Ferencz. Great sense of humor and was really open to talking about the college process and giving reassurance which was a huge plus. As for the material, it is about women in the media. His class, however, doesn't simply narrow it down to books, but a broad intersection of other media. Short stories, art history and photography, and even Disney songs and children's toys are all sources of media that we have talked about this semester. The first project is a collage and he kinda nukes everyone's grades by 5%.... but he says he only does that for the 1st project and slowly your grade goes up, so you end up with a 96-97. The class is engaging and you will have to write 1-2 essays over the course of the semester with a final project."
        ],
        "description": "Women's Voices is open to seniors who wish to examine issues of power dynamics, sexuality, body-image, relationships, representation, and gender roles - from a solely female perspective. Reading works written only by women, we will investigate our own assumptions and prejudices, and examine the ways in which these issues have been treated by a number of women authors throughout history. We will focus both on the subjects these women bring up and the ways in which they write, expressing their voices in forms often different from those used by their male counterparts. We will also examine the ways in which women bring other aspects of their identity - race, class, sexual orientation - into their work. Writing assignments will include personal reflections, analytical papers, and creative pieces. Active participation in class discussion is essential. Course content is discussed in a liberal manner; have an open mind and be respectful of others' opinions. This course is offered in both the fall and spring semesters, but may only be taken for one term. Women's Voices will challenge you to rethink everything you thought you knew in a safe, collaborative environment.",
        "name": "Women Voice Literature",
        "periods": "8, 9",
        "prereqs": "Seniors who did not take the class already",
        "teacher": "Ferencz"
      }
    ]
  },
  {
    "section": "Mathematics",
    "classes": [
      {
        "comments": [
          "Rubinstein is very nice and he actually cares about the subject (he was talking about reading calculus books). It's his first year teaching it and the class material is pretty straightforward. Tests are exactly like classwork and homework. Homework is usually just finishing stuff from class."
        ],
        "description": "Calculus Applications is a one semester non-AP Calculus course in which students are introduced to the most important parts of a standard year long calculus course.  There is an emphasis on some of the practical applications in calculus related to real world problems.  A student who completes this course will have a good background for an introductory college Calculus course that many colleges require.",
        "name": "Calculus Applications",
        "periods": "4",
        "prereqs": "Seniors taking Personal Finance",
        "teacher": "Rubinstein"
      }
    ]
  },
  {
    "section": "Physics",
    "classes": [
      {
        "comments": [
          "Sci-fi cinema is literally watching movies. You have one hw assignment a week which is like 350 words max. The projects are fun too.",
          "Sci-fi cinema is so light. We just watched movies. We have homework every two weeks which is usually just some reading about a movie we watched and then 250 words about it, and there's like 2 major projects: one is a short film (like less than a minute) and the other is a video essay. Definitely recommend if you want to take a science elective but don't want too much work/actual science."
        ],
        "description": "Science Fiction Cinema is a one-term course that examines the emergence and evolution of science fiction in a parallel fashion with developments in the natural sciences, from the late 19th Century to the present. Since cinema self-reflexively utilizes technology to examine technological issues, films will serve as the course's primary texts in considering the themes and approaches of science fiction. Among the science fiction themes and methodologies examined in this course include extrapolation, cognitive estrangement, possible worlds (counterfactuals), alternative time-space continuums, artificial intelligence, and cybernetics. Students will also receive an introduction to various topics pertaining to the philosophy of technology and new media theory. Through these means, this course seeks to provide students with a greater understanding of screens and screened media, what they can do, their impact on human psychology and society, and how a study of screened media can shed light on sociocultural issues. In addition, this course will examine various topics from film theory and genre studies.",
        "name": "Science Fiction Cinema",
        "periods": "2",
        "prereqs": "Passed physics",
        "teacher": "Miner"
      }
    ]
  },
  {
    "section": "Social Studies",
    "classes": [
      {
        "comments": [
          "Spanish Civil War is an amazing class if you like history and is taught by Hanna. You'll really enjoy it, it's a pretty high demand elective too. Textbook homework is assigned every day and you need to know the homework for the class, but I think his teaching is so enjoyable that it makes up for it.",
          "Spanish Civil War is so good. Hanna is an amazing teacher and the final project is writing a short autobiography about a veteran who served in the war and it's published on the class website. There was homework like every class and it involved textbook reading and answering some questions.",
          "Test(s) consisted of a number of short answer passages where you had to choose a certain number to complete. The point was to look at documents and make an argument based on them, using the historical context."
        ],
        "description": "This course, though primarily a history course, will also feature both artistic and literary components, featuring painters such as Joan Miró and poet-journalists such as Langston Hughes. The course complements both the AP European History and AP United States History courses. Focusing on the 1930s as the crucial decade in the rise of fascism and the defense of democracy and socialism. With authoritarian style governments on the rise globally, this course is also, unfortunately, timely.",
        "name": "Spanish Civil War",
        "periods": "N/A, Likely 8",
        "prereqs": "Junior/Seniors",
        "teacher": "Hanna"
      },
      {
        "comments": [
          "Geopolitics with badgley should be super interesting in person. The readings and information covered in class are very intense though so be ready to get your mind thinking.",
          "Geopolitics is a very interesting class that talks about current issues and events. There won't be daily assignments, just a couple readings and answering questions about articles. But you will have some larger assignments (presentation, 2 papers about a book that you get to choose). I found the class itself enjoyable due to the more discussion based class time, if you can contribute go ahead, otherwise, you can just listen and be observant."
        ],
        "description": "This course, though primarily a history course, will also feature both artistic and literary components, featuring painters such as Joan Miró and poet-journalists such as Langston Hughes. The course complements both the AP European History and AP United States History courses. Focusing on the 1930s as the crucial decade in the rise of fascism and the defense of democracy and socialism. With authoritarian style governments on the rise globally, this course is also, unfortunately, timely.",
        "name": "Geopolitics",
        "periods": "8",
        "prereqs": "Juniors/Seniors",
        "teacher": "Badgley"
      },
      {
        "comments": [
          "One multiple choice test, one in-class essay, and two geography quizzes."
        ],
        "description": "This is a history course, about the Islamic World. We will discuss issues of religion, but this is not a theology course. No background in religion is expected, and no answers to religious quandaries will be given.",
        "name": "History of the Islamic World",
        "periods": "9",
        "prereqs": "Juniors/Seniors",
        "teacher": "Berman"
      },
      {
        "comments": ["Nyc history will require some more effort and studying."],
        "description": "One of the main objectives of this class will be to study how this dramatic transformation took place. In addition, this course will explore the profound legacy the Dutch left on New York, the forgotten but critical role the city played in the American Revolution and WWII, and the development of New York as the entertainment, and media capital of the nation. The course will also look at the tremendous role immigrants and social activists have had and still play in shaping New York. Another fascinating aspect of the class will be our study of the city's decline into virtual bankruptcy in the 1970s, the Hi-Hop Revolution and the city's revival in the nineties. Finally, we will look at the September 11th terrorist attack, arguably the most important event in the city's history and how it demonstrated New York's resilient spirit.",
        "name": "New York City History",
        "periods": "N/A, Likely 8",
        "prereqs": "Juniors/Seniors",
        "teacher": "Sandler"
      },
      {
        "comments": [
          "The one thing I'll say is Polazzo loves to talk - most of the class is generally lectures, but he will go off on digressions about student questions and random stuff. Overall though, he does cover the material pretty well, and while the classes aren't easy they're def manageable if you're interested in the material (more concepts than memorization).",
          "AP Comp Gov is also good if you're interested in the wider world, and it's a bit lighter after all the memorization of the first semester.",
          "Polazzo teaches Comp and he's pretty good, he'll actually explain everything and his classes are always lively."
        ],
        "description": "A comparative study of six nations--Britain, Russia, China, Nigeria, Mexico and Iran--serves as a core of the course. By examining the political implications of different types of social and economic development, students become familiar both with general political concepts and with a broad array of specific issues, and they are able to use their knowledge as a template for examining contemporary events in other countries.",
        "name": "AP Comparative Government and Politics",
        "periods": "N/A, Likely 5,6,7",
        "prereqs": "Juniors/Seniors, passed Government",
        "teacher": "Polazzo"
      },
      {
        "comments": [
          "I had Ms. Weissman for AP Gov junior year and it was an experience to say the least. She talks like a lot, and I mean like full periods worth of yapping. We did not get anything done and when I finished the class in the fall, we only finished 2 units out of a 5 unit curriculum. For the second term seniors, please simply pick up a Princeton AP Gov workbook and watch the CollegeBoard videos because they will be so much more helpful than even going to Ms. Weissman's class. I'm not sure how Polazzo is, but I'm pretty sure he touches much better and with a grip on the curriculum than Ms. Weissman does. Overall, if you want to go to a class that's just 41 minutes of Ms. Weissman talking and her thoughts on politics, it's somewhat worth it. Also her projects and her grading is super random, like a literal random number generator so simply try your hardest and then pray for a good grade in the class."
        ],
        "description": "The course deals with the dynamics of politics in America. We will be studying the American political system at the national level. Included will be a study of lobbies, forms of political participation, elections, political parties, and national political institutions: The Presidency, The Congress, The Judiciary.",
        "name": "AP US Government Politics (Core)",
        "periods": "1, 2, 3, 4, 6, 7, 8",
        "prereqs": "Junior/Senior, passed US History",
        "teacher": "Weissman"
      },
      {
        "comments": [
          "Schweitzer gives homework everyday (Perusall and very occasionally a really long edpuzzle vid) and there's a test every other Friday. Schweitzer is pretty understanding in terms of late hw + make-up tests but if you look confused in class, she won't hesitate to cold call on you even if you're paying attention. She's also not that generous with participation grades even if you actively participate everyday. It can be interesting sometimes but Schweitzer focuses a lot more on the AP curriculum itself instead of relating it to current events. it's only worth taking if you have a genuine interest in economics (which i thought i did, but apparently not). I also thought it would be a light AP to take my senior year but that was very far from the case."
        ],
        "description": "AP Microeconomics is an introductory college-level microeconomics course. Students cultivate their understanding of the principles that apply to the functions of individual economic decision-makers by using principles and models to describe economic situations and predict and explain outcomes with graphs, charts, and data as they explore concepts like scarcity and markets; costs, benefits, and marginal analysis; production choices and behavior; and market inefficiency and public policy.",
        "name": "AP Microeconomics",
        "periods": "N/A, Likely 3,4,5,9",
        "prereqs": "Passed economics",
        "teacher": "Schweitzer"
      },
      {
        "comments": [
          "Barry is nice and funny, classwork and homework is very light (basic article and textbook readings). He teaches mostly with lectures and slides. His tests and quizzes are generally pretty hard though, but he does curve."
        ],
        "description": "Introduction to economic analysis and its application. Among the topics studied will be: the theory of supply and demand, costs and revenue of the firm under various levels of competition, the factors of production, the stock market, labor, agriculture, the distribution of income, monetary and fiscal policy, banking, inflation, taxes, government spending, international trade and comparative economic systems.",
        "name": "Economics (Core)",
        "periods": "1, 2, 5, 6, 9, 10",
        "prereqs": "Junior/Senior, Passed Government",
        "teacher": "Wang, Barry"
      }
    ]
  },
  {
    "section": "Technology",
    "classes": [
      {
        "comments": [
          "Griffith's interior design class is a pretty enjoyable and light class. He'll lecture for a few days before transitioning into a project regarding said lesson. This cycle pretty much continues throughout the entire term. Project assignments are graded incredibly fairly and he's always willing to work with you to ensure you do well in class. (deadlines, resubmissions, etc.)"
        ],
        "description": "Interior Design is a one-semester course that introduces students to the world of designing, constructing, and refurbishing a pre-existing space. In this class, students will learn relevant symbols, materials, and skills related to the field of interior design.",
        "name": "Interior Design",
        "periods": "2",
        "prereqs": "Drafting and/or Computer Science (Taken/Taking)",
        "teacher": "Griffith"
      },
      {
        "comments": [
          "Dillon's Animation is a light class that is chill with no homework if you finish the classwork. Much of the teaching comes from Youtube videos and Blender practice. Dillon is a chill teacher that is very laxed about deadlines. As long as you do your work without distracting others, you can pretty much use the class how you like."
        ],
        "description": "Animation is a one-semester course that introduces students to animation techniques within the program Blender. Skills that you will learn during this course include:  modeling, texturing, and animation. During this course, students will create a short animated film in which they will write, animate, and film all aspects of it.",
        "name": "Animation",
        "periods": "8, 9",
        "prereqs": "Drafting and/or Computer Science (Taken/Taking)",
        "teacher": "Dillon"
      },
      {
        "comments": [
          "Blay (robotics coach) teaches intro to robotics and it's mainly a project based class, you basically are guaranteed 85 points as long as you're helping your group and the last 15 points are based on where you rank if it's a competitive project. He's super chill though and really great! He'll even put on music during the class period. He just really hates when people cut. So do not cut. He also gives occasional tests/quizzes that are all multiple choice (and you can bring an index card as a reference sheet).",
          "For those with robotics experience already, this class uses VEX Robotics as the main building material, and the programming is done in C,"
        ],
        "description": "Intro to Robotics is a one-semester course that introduces students to the study of robotics and key stem principles. This class covers topics such as physics, computer science, and mechanical engineering. The final project for this class is designing and building a robot for an in-class competition.",
        "name": "Intro to Robotics",
        "periods": "5, 6",
        "prereqs": "Drafting and/or Computer Science (Taken/Taking)",
        "teacher": "Blay"
      }
    ]
  },
  {
    "section": "Phyiscal Education",
    "classes": [
      {
        "comments": [
          "Fang is super nice! The class is mostly lecture-based with the occasional hands-on practicing of skills. Tests are either on paper or skill tests where you perform the steps to certain procedures such as CPR. There’s a final at the end which id you pass you can become Red Cross certified for two years. Overall very chill and informative class."
        ],
        "description": "The importance and purpose of this course is to help students build up skills on how to identify and eliminate potentially hazardous conditions in their environment, recognize different types of emergencies, and take appropriate actions for first aid care and CPR. It teaches students lifesaving skills necessary for them to provide immediate care for a suddenly ill or injured person until more advanced medical care arrives. Students will get certified in CPR and first aid after completing this course and meeting all the requirements.",
        "name": "CPR",
        "periods": "7",
        "prereqs": "PHS11 (Taken/Taking), Sophomore/Junior/Senior",
        "teacher": "Fang"
      },
      {
        "comments": [],
        "description": "This course will explore Leadership & Social-Emotional Learning which is the foundation of sports and athletics. Students will learn the importance of team building, character development, and restorative practices.  This is a course that will help develop and lay out coaching philosophies and strategies by studying and assessing a variety of coaches from different sports. It is a discussion-based class and students will be given coaching scenarios that they will respond to. Students will also learn sports officiating from positioning on the field/court to signal calling and control of the game. These skills will be developed and applied in Stuyvesant physical education classes, with a focus on possible careers in Coaching, Teaching, and Refereeing. This class contains project-based learning & assignments, practical application of skills, & public speaking.",
        "name": "Foundations of Sports",
        "periods": "N/A",
        "prereqs": "Junior/Senior",
        "teacher": "Miller, Morel"
      },
      {
        "comments": [
          "The class is pretty fun and we've covered the meringue and the waltz. She goes through the steps with us so that we get it and we get little assessments on our steps, rhythm, flow, etc. Overall, a very low-stress class for people who just want to learn how to dance.",
          "Ballroom is super fun, especially if you take it with friends. You learn different dances and Choy makes it super easy because she breaks it down and you get a lot of practice. You usually start out by learning a move with someone you know and then switch partners every couple of minutes."
        ],
        "description": "“Ballroom is a social class that involves learning how to Waltz, Foxtrot, Tango, Merengue, Rumba, Cha Cha, and Swing. Learning to dance is uplifting and fun and will help you develop strength and muscle definition as well as general endurance. No experience is necessary.",
        "name": "Ballroom",
        "periods": "3, 4",
        "prereqs": "Senior",
        "teacher": "Choy"
      },
      {
        "comments": [
          "It alternates between 2 days of kickboxing (which is literally jumping up and down for 10 minutes, punching/kicking the air, and then stretching), core workouts, and yoga days."
        ],
        "description": "“Aerobics is a class designed for students looking to experience challenging fitness in a fun and motivating group setting usually with music in the background. Exercises will focus on cardiovascular fitness, muscular strength and endurance, flexibility, balance, and agility. Aerobic workouts include but are not limited to cardio kickboxing, dance aerobics, step aerobics, and Zumba-inspired workouts.",
        "name": "Aerobics",
        "periods": "N/A",
        "prereqs": "Junior/Senior",
        "teacher": "Choubaralian"
      },
      {
        "comments": [
          "I had Indoor Cycle with Luczak but I am not sure if she still teaches it. The class was really chill and we just cycled on a bike the entire time. If you want to be more active and try out different activities then maybe take another gym class.",
          "Expect to lift small weights on a bike for the entire class."
        ],
        "description": "“Stuyvesant has its own state-of-the-art Spin studio. This class introduces students to Spinning and teaches them how to set up the bike, build endurance, and design a Spinning fitness routine.",
        "name": "Indoor Cycling",
        "periods": "6",
        "prereqs": "Junior/Senior",
        "teacher": "Luczak, Markova"
      },
      {
        "comments": [
          "This class is pretty chill, especially if you are already a very flexible person. This may depend on the teachers, but usually Mondays or Tuesdays are for “meditation”, so you can just relax for the period. Also, the last five minutes of each class is dedicated to a short nap, which is pretty fire!",
          "Classes end with corpse pose which is just lying on the ground and usually Mondays is just corpse pose for the whole class. It’s great for power naps."
        ],
        "description": "“Focusing on yoga and meditative practices, this class will help improve your flexibility, and teach stress reduction techniques and mindfulness activities. Guaranteed to improve your focus, yoga is a practice that can be used daily without the need for expensive equipment and is a lifelong fitness skill.",
        "name": "Yoga",
        "periods": "1, 2, 5, 7, 8, 9",
        "prereqs": "Junior/Senior",
        "teacher": "Choy, Morel, Freytag"
      },
      {
        "comments": [
          "I’m taking it with Ms. Luczak right now! I kinda love it! Sometimes we just run and sometimes we run to the pier and chill on the swings or around the soccer field and then play frisbee. On very cold or rainy days we go to the weight room."
        ],
        "description": "“The Polar Bear class goes outside almost every day. It involves a lot of running and exercising outside in any weather. On Fridays, the class pulls back to repair and heal, while enjoying a game of Frisbee, volleyball, or soccer at the local athletic field. The only requirement for this class is a pair of running sneakers and a desire to practice perseverance.",
        "name": "Polarbear",
        "periods": "N/A",
        "prereqs": "Junior/Senior",
        "teacher": "Markova, Luczak"
      },
      {
        "comments": ["Super chill. You can just work out."],
        "description": "The course will focus on learning and reinforcing the proper guidelines, principles, and techniques of weight-lifting. Students will be introduced to the 5 health-related components of fitness: muscular strength, muscular endurance, cardiovascular endurance, flexibility, and body composition. Students will be given opportunities to improve physical fitness, acquire knowledge of fitness concepts, and practice positive personal and social skills. The class is structured for any ability level from a beginner, someone who has never lifted free weights before, or an athlete who has a regular weight lifting program.",
        "name": "Weight Training",
        "periods": "1, 3, 4",
        "prereqs": "Junior/Senior",
        "teacher": "Autry, Miller"
      },
      {
        "comments": [
          "You fall, you cry, you make friends, you will love it!! It’s a good class where you actually learn how to become a more confident skater over time!! Can be scary sometimes, but you learn cool skills and Mr. C is so nice!!"
        ],
        "description": "This class is designed to teach students without experience how to ride in-line skates. The focus will be to develop basic skills like gliding, braking and turning while allowing students to explore their limits with a variety of other skills. The class will most often be skating outside around the park and the piers. All equipment will be provided by the school. There is an advanced class option for seniors in the spring semester who have taken the class before or have personal experience.",
        "name": "Rollerblade",
        "periods": "4, 6",
        "prereqs": "Junior/Senior",
        "teacher": "Choubaralian"
      },
      {
        "comments": [
          "Basketball was literally going outside for the first half of the year and then going to the weight room for the second half of the year. Top tier class."
        ],
        "description": "The class will focus on the learning of essential basketball skills, developing knowledge of the basketball rules and terminology, proper techniques, and safety issues. Instruction will focus on the proper fundamentals and highlight shooting, passing, and dribbling. Students with varying levels of experience will have the opportunity to gain new skills or refine their technique through drills and practice.",
        "name": "Basketball",
        "periods": "N/A",
        "prereqs": "Junior/Senior",
        "teacher": "Barbin, Miller"
      }
    ]
  }
]
