[
  {
    "Scholarship Name": "The Dream US Scholarship",
    "Member": "Jason Chu",
    "Info": "TheDream.US Scholarship is a vital opportunity for undocumented immigrant students pursuing higher education in the United States. This scholarship is designed for students who have shown exceptional academic promise and dedication, regardless of their immigration status. Recipients are awarded up to $33,000 over four years to help cover tuition and other educational expenses. The application process typically consists of multiple essays that allow students to share their personal stories, academic achievements, and future goals. The scholarship has two phases: an initial application round with a due date typically in late February, and a final round for selected finalists.",
    "Link": "https://www.thedream.us/scholarships/",
    "Deadline has passed": "Late February"
  },
  {
    "Scholarship Name": "SAE.org Scholarships",
    "Member": "Raymond Wang",
    "Info": "SAE.org Scholarships are an excellent opportunity for students who are passionate about aerospace, automotive, and mobility engineering. These scholarships aim to provide financial support to students who are pursuing careers in these exciting fields. The amount of money awarded can vary from $1,000 to $10,000 or even more, depending on the specific scholarship. The application process usually involves writing essays, with the number of essays required varying from one scholarship to another. Typically, the application process consists of two phases: an initial application and, for selected candidates, an interview phase. Applications will be accepted for the 2023/24 academic year from February 1- February 28, 2023.",
    "Link": "https://www.sae.org/participate/scholarships/",
    "Deadline has passed": "February 28"
  },
  {
    "Scholarship Name": "Read Thread Foundation Scholarship",
    "Member": "Karen Chen",
    "Info": "Aimed toward foreign, immigrant, and first-gen female students who plan to attend a US college as a first-year student in Fall 2024. The application includes short answer questions, two essays, and one recommendation. Applications open in February and are due February 28, 2024. Selected applicants will be interviewed, and final results will be released in June. Successful applicants receive $1,000, mentorship, and connections with other accomplished women.",
    "Link": "https://redthreadwomen.org/",
    "Deadline has passed": "February 28"
  },
  {
    "Scholarship Name": "Wgu.edu",
    "Member": "Andrew-Rafael Said",
    "Info": "$2500 back to school scholarship open to all students. Main audience are business degrees. Goals is to make college easier for many students by making it cheaper. The application is free and just consists of legal information like your name. This is for the wgu school of business . No minimum gpa or requirements to apply.",
    "Link": "http://wgu.edu",
    "Deadline has passed": "Deadline?"
  },
  {
    "Scholarship Name": "Google Scholarship",
    "Member": "Kate Bondarenko",
    "Info": "Awarded to high school seniors planning to enroll in a Bachelors program in college to study computer science or technology. Applicants must have a strong academic record, demonstrate financial need, and have “leadership and passion for improving representation of underrepresented groups in computer science and technology”. There are two essay questions, and applicants submit a resumé, 1 letter of recommendation, and academic transcript as well. The deadline last year was in March, it looks like they haven’t updated their website for this school year. The scholarship is $10,000.",
    "Link": "https://buildyourfuture.withgoogle.com/scholarships/generation-google-scholarship",
    "Deadline has passed": "March..?"
  },
  {
    "Scholarship Name": "Expand Your Horizons",
    "Member": "Karen Chen",
    "Info": "Awarded to students passionate about education. Examples include being involved in community service, participating in school activities, and learning languages. A total of $2,000 will be awarded to one finalist. Application requires creation of a bold.org profile. The scholarship application deadline is due April 28, 2024 and the winner will be announced April 30, 2024.",
    "Link": "https://www.keepgoingforward.org/expandyourhorizons",
    "Deadline has passed": "April 28"
  },
  {
    "Scholarship Name": "Sallie Mae Scholarship",
    "Member": "Raymond W",
    "Info": "The Sallie Mae Bank is offering $2,000 scholarships every month to help pay for higher education. High school seniors are recommended to apply. There are no tricks or hidden clauses for this scholarship, it is a simple no-essay scholarship. The scholarship runs on a rolling deadline with deadlines usually falling at the end of every month.",
    "Link": "",
    "Deadline has passed": ""
  },
  {
    "Scholarship Name": "GE-Reagan Foundation Scholarship Program",
    "Member": "Shreya Das",
    "Info": "The GE-Reagan Scholarship is a prestigious award for high school seniors in the United States, offered by the Ronald Reagan Presidential Foundation and Institute. It recognizes students who demonstrate exceptional leadership, academic excellence, and a commitment to the values of integrity and citizenship. Multiple awards and renewable scholarships are offered through this program, with upwards to $10,000 per year in value. Candidates for this program must maintain a minimum 3.0 GPA and follow through the program with essays and recommendation letters. Deadline for application: January 5th",
    "Link": "",
    "Deadline has passed": ""
  },
  {
    "Scholarship Name": "Appily Easy Money Scholarship",
    "Member": "Karen Chen",
    "Info": "Open to any US residents 13 years old or older. Applicants will answer a short questionnaire about GPA, graduation date, prospective colleges, demographic, etc. There is no essay. A winner is randomly chosen to win $1,000 each month.",
    "Link": "",
    "Deadline has passed": ""
  },
  {
    "Scholarship Name": "Greenhouse Scholarship",
    "Member": "Elaine H",
    "Info": "The Greenhouse Scholarship offers $5,000 a year to winners, plus enrollment in growth and development themed programs. Applicants must be high school seniors, low-income, and live in one of 5 states (New York is included) and have a minimum 3.5 GPA. Round 1, Nov. 21: A short response. Round 2, Dec. 1: Essay and 2 rec letters. Round 3, Jan 24: A short video. Round 4, Apr. 4: Scheduled interview.",
    "Link": "",
    "Deadline has passed": ""
  },
  {
    "Scholarship Name": "Truman Scholarship",
    "Member": "Andrew-Rafael Said",
    "Info": "The Truman Scholarship supports those who are committed to public service. They select 65 people from 800 each year . There is no minimum gpa to apply but there is an essay required. Students must also have  teacher recommendations. The scholarship is nation wide and applies to every major",
    "Link": "",
    "Deadline has passed": ""
  },
  {
    "Scholarship Name": "Horatio Alger Patricia Cole Scholarship",
    "Member": "Snigdho Somprity",
    "Info": "*This scholarship opens on December 1st, 2023. \n\nThe Patricia Cole Scholarship Program is funded by Association Friend of Distinction Patricia Cole. It’s awarded to current high school seniors who exhibit a strong desire to pursue and complete a bachelor’s degree in business or STEM (science, technology, engineering, or mathematics). All applicants must have a grade point average (GPA) of 2.0. The scholarship grants 6 awards that are worth $12,500 each.",
    "Link": "",
    "Deadline has passed": ""
  },
  {
    "Scholarship Name": "Courageous Persuaders",
    "Member": "Elaine H",
    "Info": "High school students can create a 30 second video based on the theme (this year: safe driving) to enter competition for scholarships of up to $2500. Videos are due March 11, 2024. They are judged by category and persuasiveness. More than one can be submitted. ",
    "Link": "https://courageouspersuaders.com/",
    "Deadline has passed": "March 11"
  },
  {
    "Scholarship Name": "Morgan Levine Dolan Community Service Scholarship",
    "Member": "Elaine H",
    "Info": "The Morgan Levine Dolan Community Service Scholarship seeks to help applicants who are team players and have experience playing sports in high school or volunteering for community services in their local communities. High school, undergraduate, and graduate students in New Jersey, Connecticut, New York, or Pennsylvania are eligible to apply if they have volunteer experience or have played sports. To apply, write about how this scholarship will help you fulfill your future goals. 5 winners will be selected to win $25,000 each, and the application is due May 18, 2024 (winners announced June 18th). Applicants write one 400-600 word essay about how the scholarship will help them pursue their future career goals. ",
    "Link": "https://bold.org/scholarships/morgan-levine-dolan-community-service-scholarship/",
    "Deadline has passed": "May 18"
  },
  {
    "Scholarship Name": "Ryan T. Herich Memorial Scholarship",
    "Member": "Elaine H",
    "Info": "3 students win $5,000 each. You must be planning to study political science, cultural anthropology, geography, or history. To apply, write about yourself (400W-600W) and how you plan to make a difference in the world by better understanding how the lessons learned from history, cultural anthropology, political science or geography might make the world a better place. Since this is a bold.org scholarship you need a profile on the site. The app is due April 15th.",
    "Link": "",
    "Deadline has passed": "April 15"
  },
  {
    "Scholarship Name": "Department of Defense (DoD) Scholarship-for-Service Program",
    "Member": "Jason C",
    "Info": "The SMART Scholarship-for-Service Program is a combined educational and workforce development opportunity for STEM students. SMART offers scholarships for undergraduate, master's, and doctoral students pursuing a STEM degree. Scholarship recipients receive full tuition, annual stipends, internships, and guaranteed employment with the Department of Defense after graduation. Applications are open annually from August 1-December 1. Program is a cybersecurity-focused scholarship program aimed at recruiting and training individuals to work in the field of information assurance and cybersecurity. SMART scholars earn annual stipends between $30,000-$46,000 depending on degree level.",
    "Link": "https://www.smartscholarship.org/smart/en",
    "Deadline has passed": "December 1"
  },
  {
    "Scholarship Name": "De Los Santos Family Scholarship",
    "Member": "Karen C",
    "Info": "Open to Filipino-American high school seniors set to graduate in 2024. Applicants must have at least a 3.0 GPA. Applicants must respond to a prompt describing a significant challenge that affected their academic achievement and their experience being Filipino-American. The deadline is June 15, 2024 and the winner will earn $1,000.",
    "Link": "https://bold.org/scholarships/de-los-santos-family-scholarship/",
    "Deadline has passed": "June 15"
  },
  {
    "Scholarship Name": "SuperCollege Scholarship",
    "Member": "Raymond W",
    "Info": "Open to all students, the SuperCollege scholarship is a simple no-essay scholarship that serves to help pay for the additional costs of college. All an applicant needs to do to apply is complete the online application form found at the link. A complete form is an entry to win the scholarship. This scholarship is due February 29th and will award the winner with $1,000 straight to their bank account.",
    "Link": "https://bold.org/scholarships/ryan-t-herich-memorial-scholarship/",
    "Deadline has passed": "February 29"
  }
]
