[
  {
    "Scholarship Name": "$25,000 Be Bold Scholarship",
    "Member": "Raymond Wang",
    "Info": "Looking for students who stand out from the rest with their “boldness”. The organization describes their search for “boldness” as a search for strong character, relentless determination, and an unwavering commitment to revolutionizing our world for the better. The winner of the scholarship receives $25,000. This scholarship is strictly no-essay; your bold.org profile is your application. The scholarship runs on a rolling basis, so the next due date is December 1st, 2023. I would recommend this scholarship to everyone as it only takes about 15 minutes to apply.",
    "Link": "https://bold.org/scholarships/the-be-bold-no-essay-scholarship/",
    "Deadline has passed": "December 1"
  },
  {
    "Scholarship Name": "Cooke Scholarship",
    "Member": "Kate Bondarenko",
    "Info": "Open to high school seniors who plan to enroll in a 4-year college once they graduate. Applicants should have a 3.5 GPA and demonstrate unmet financial need. The scholarship is up to $55,000 per year. The due date is November 16, 2023. Two academic recommendations, a counselor recommendation, school report, and transcript should all be submitted through Common App. Semifinalists are announced in January, and scholarship recipients are announced in March.",
    "Link": "https://www.jkcf.org/our-scholarships/college-scholarship-program/",
    "Deadline has passed": "November 16"
  },
  {
    "Scholarship Name": "Ron Brown Scholarship",
    "Member": "Elaine Huang",
    "Info": "Offers: $40,000, mentoring, leadership experiences, and service opportunities \nFor: African American seniors enrolling in a 4-year degree-granting college\nRequirements: Two letters of recommendation (at least one from high school counselor, teacher or principal, other can be from anyone) and two ~500 word essays (one is a question and one is about anything)\nDeadlines: Application due by December 1st, rec letters due December 15th",
    "Link": "https://ronbrown.org/",
    "Deadline has passed": "December 1"
  },
  {
    "Scholarship Name": "Perseverance is Key\" Scholarship",
    "Member": "Snigdho Somprity",
    "Info": "Will be granted to students who have demonstrated perseverance throughout their lives. For high school students who are at least 13 years old and undergraduate students who are currently studying in the United States. Special consideration will be given to minority students, students who have experienced foster care, and students who will/are first-generation college students. There will be 4 awards, composed of $1,000 each. Applicants need to respond to an essay prompt, which can be found on the scholarship’s website. The deadline to apply is 11:59 PM (EST) December 15th, 2023.",
    "Link": "https://accessscholarships.com/perseverance-is-key-scholarship/",
    "Deadline has passed": "December 15"
  },
  {
    "Scholarship Name": "Jackie Robinson Scholarship Program",
    "Member": "Karen Chen",
    "Info": "Open to minority high school seniors who plan to earn a bachelor's degree from a four-year university. Selected Jackie Robinson Foundation Scholars receive grants up to $30,000 throughout four years of university and are enrolled in the foundations \"42 Strategies for Success Curriculum,\" which teaches students to navigate college and develop career and leadership skills. Applicants must be United States citizens and demonstrate financial need, academic excellence, leadership, commitment to community service, plan to attend a four-year college in the United States or a college affiliated with a United States-based college, and have earned less than 25% of college credits. The application requires one recommendation, demographic information, high school information, an unofficial transcript, college plans, activities and awards, household information, and four essays. Test scores (AP, PSAT, ACT, SAT) are optional. The application is due at 5p.m. EST on January 10, 2024. Applications will be reviewed between February–April and semifinalist interviews will occur April–May. Application status will be announced in June 2024.",
    "Link": "https://jackierobinson.org/scholarship/",
    "Deadline has passed": "January 10"
  },
  {
    "Scholarship Name": "Greenhouse Scholars Program",
    "Member": "Shreya Das",
    "Info": "Open to current high school students planning to attend a four-year institution. Students must have a cumulative and unweighted GPA of 3.5 and must demonstrate financial need to apply (income must be no more than $80,000 annually). There are four parts to the application process for this program. The eligibility survey and initial questionnaire in the first round will close on November 21. The other rounds go through your academic information (rec letters, school transcripts, test scores), essay responses, video responses, and ends with an interview to determine acceptance into the program. Final decisions will be made on the week of April 25.",
    "Link": "https://greenhousescholars.org/our-scholars/become-a-scholar/",
    "Deadline has passed": "November 21"
  },
  {
    "Scholarship Name": "Burger King Scholarships Program",
    "Member": "Jason Chu",
    "Info": "Applicants should be high school seniors planning to enroll in a four-year college or university upon graduation. A minimum GPA of 3.5 is required to be eligible for this scholarship. Demonstrated unmet financial need is a significant consideration for selection.The Burger King Scholars Program offers scholarships that can be as substantial as $55,000 per year. To apply for the Burger King Scholars Program, applicants must go through the Common App platform. Required documentation includes two academic recommendations, a counselor recommendation, school report, and an official transcript.  October 16 through December 15, 2023",
    "Link": "https://www.burgerkingfoundation.org/programs/burger-king-sm-scholars",
    "Deadline has passed": "December 15"
  },
  {
    "Scholarship Name": "10 words or less scholarship",
    "Member": "Andrew-Rafael Said",
    "Info": "Must be at least 14-25 years of age and attending school in fall 2024. Mission has been to help connect students with the right schools for them. No minimum gpa, or test score requirement. No essay required. To apply to the 10 Words or Less Scholarship, applicants must go to the student scholarships website and write in 10 words or less why they deserve to get the scholarship. Applicants must also put a like on the facebook page. The scholarship value is $1000. The deadline to apply is November 15, 2023.",
    "Link": "https://studentscholarships.org/easy.php",
    "Deadline has passed": "November 15"
  },
  {
    "Scholarship Name": "Niche $2,000 No-Essay Scholarship",
    "Member": "Raymond Wang",
    "Info": "Any high school student planning to attend a college or university in the next year is recommended to apply for this scholarship. It is a simple, no-essay scholarship that is solely dependent on your profile as a student. If won, the winner is rewarded with a no-strings-attached $2,000 scholarship. This scholarship runs every month and uses rolling deadlines; the next deadline is at the end of this month on October 31st, 2023.",
    "Link": "https://www.niche.com/colleges/scholarships/no-essay-scholarship/",
    "Deadline has passed": "End Of Month"
  },
  {
    "Scholarship Name": "Ambition Scholarship",
    "Member": "Elaine Huang",
    "Info": "Offers: $550 \nFor: Female high school students\nRequirements: 3.5+ GPA, any experience in volunteering or extracurriculars, 400-600 word response to question: What are your future dreams, and what have you done to set yourself on a path to achieving those dreams?\nDeadlines: Jan 31, 2024 // Winners announced Feb 29 2024",
    "Link": "https://bold.org/scholarships/ambition-scholarship/",
    "Deadline has passed": "January 31"
  },
  {
    "Scholarship Name": "The Dream US Scholarship",
    "Member": "Jason Chu",
    "Info": "TheDream.US Scholarship is a vital opportunity for undocumented immigrant students pursuing higher education in the United States. This scholarship is designed for students who have shown exceptional academic promise and dedication, regardless of their immigration status. Recipients are awarded up to $33,000 over four years to help cover tuition and other educational expenses. The application process typically consists of multiple essays that allow students to share their personal stories, academic achievements, and future goals. The scholarship has two phases: an initial application round with a due date typically in late February, and a final round for selected finalists.",
    "Link": "https://www.thedream.us/scholarships/",
    "Deadline has passed": "Late February"
  },
  {
    "Scholarship Name": "SAE.org Scholarships",
    "Member": "Raymond Wang",
    "Info": "SAE.org Scholarships are an excellent opportunity for students who are passionate about aerospace, automotive, and mobility engineering. These scholarships aim to provide financial support to students who are pursuing careers in these exciting fields. The amount of money awarded can vary from $1,000 to $10,000 or even more, depending on the specific scholarship. The application process usually involves writing essays, with the number of essays required varying from one scholarship to another. Typically, the application process consists of two phases: an initial application and, for selected candidates, an interview phase. Applications will be accepted for the 2023/24 academic year from February 1- February 28, 2023.",
    "Link": "https://www.sae.org/participate/scholarships/",
    "Deadline has passed": "February 28"
  },
  {
    "Scholarship Name": "Read Thread Foundation Scholarship",
    "Member": "Karen Chen",
    "Info": "Aimed toward foreign, immigrant, and first-gen female students who plan to attend a US college as a first-year student in Fall 2024. The application includes short answer questions, two essays, and one recommendation. Applications open in February and are due February 28, 2024. Selected applicants will be interviewed, and final results will be released in June. Successful applicants receive $1,000, mentorship, and connections with other accomplished women.",
    "Link": "https://redthreadwomen.org/",
    "Deadline has passed": "February 28"
  },
  {
    "Scholarship Name": "Milken Scholars Program",
    "Member": "Shreya Das",
    "Info": "The Milken Scholars Program selects outstanding, college-bound high school seniors who will graduate by the end of the academic year. High school guidance counselors and other staff members nominate students based on their demonstrated leadership skills, trouble with financials, and academic skill. Students must be graduating from a high school in Los Angeles County, New York City, or Washington, DC, as well as have a minimum GPA of 3.6, or above 90 in each course subject, in order to qualify. Scholarship winners receive assistance with career-related experiences and an annual monetary award of $2,000 for each of their four years of college. The deadline for nominations is November 17, and there are several stages to the application process after, with dates varying depending on your location.",
    "Link": "http://www.milkenscholars.org/our-program/selectionsforms/selection-process/",
    "Deadline has passed": "November 17"
  },
  {
    "Scholarship Name": "Sallie Mae Scholarship",
    "Member": "Snigdho Somprity",
    "Info": "The Sallie Mae scholarship is a $2,000 scholarship for United States students who are currently high school juniors or older. This scholarship does not require an essay or have any academic requirements. All that is needed is to meet the eligibility criteria and to submit the simple form on the Sallie Mae website. There are three upcoming deadlines for this scholarship: 11:59:59 PM on October 31st, 2023, 11:59:59 PM on November 30th, 2023, and 11:59:59 PM on December 31st, 2023. Winners are selected in a lottery-based system.",
    "Link": "https://www.salliemae.com/scholarships/2k-scholarship/?dtd_cell=SMPLSODCZPPSOTOTOTHOTHRN010000&utm_source=360&utm_medium=cpc&utm_campaign=acq1p_s360_s_u_u_sch_u_u&utm_content=site",
    "Deadline has passed": "October 31, November 30, December 31"
  },
  {
    "Scholarship Name": "Wgu.edu",
    "Member": "Andrew-Rafael Said",
    "Info": "$2500 back to school scholarship open to all students. Main audience are business degrees. Goals is to make college easier for many students by making it cheaper. The application is free and just consists of legal information like your name. This is for the wgu school of business . No minimum gpa or requirements to apply.",
    "Link": "http://wgu.edu",
    "Deadline has passed": "Deadline?"
  },
  {
    "Scholarship Name": "Google Scholarship",
    "Member": "Kate Bondarenko",
    "Info": "Awarded to high school seniors planning to enroll in a Bachelors program in college to study computer science or technology. Applicants must have a strong academic record, demonstrate financial need, and have “leadership and passion for improving representation of underrepresented groups in computer science and technology”. There are two essay questions, and applicants submit a resumé, 1 letter of recommendation, and academic transcript as well. The deadline last year was in March, it looks like they haven’t updated their website for this school year. The scholarship is $10,000.",
    "Link": "https://buildyourfuture.withgoogle.com/scholarships/generation-google-scholarship",
    "Deadline has passed": "March..?"
  },
  {
    "Scholarship Name": "Expand Your Horizons",
    "Member": "Karen Chen",
    "Info": "Awarded to students passionate about education. Examples include being involved in community service, participating in school activities, and learning languages. A total of $2,000 will be awarded to one finalist. Application requires creation of a bold.org profile. The scholarship application deadline is due April 28, 2024 and the winner will be announced April 30, 2024.",
    "Link": "https://www.keepgoingforward.org/expandyourhorizons",
    "Deadline has passed": "April 28"
  },
  {
    "Scholarship Name": "Scholarship Owl",
    "Member": "Andrew-Rafael Said",
    "Info": "No essay scholarship worth $50k. There will be 50 winners and the deadline to apply is October 29. There will be 6 winners selected for $1,000 each. In order to apply, you must be at least 16 years old",
    "Link": "https://scholarshipowl.com/awards/scholarship-owl-scholarship",
    "Deadline has passed": "Octover 29"
  },
  {
    "Scholarship Name": "Technology Addiction Awareness Scholarship",
    "Member": "Shreya Das",
    "Info": "This scholarship is for those currently enrolled in high school, college, or graduate school, and a legal resident of the United States. If you also believe that today's youth are suffering from addictions to technology and excessive screen time, Digital Responsibility is offering their Technology Addiction Awareness Scholarship, which awards $1,000 each year, to students who submit a piece of writing about it. The piece must be a 140-character statement, followed by a 500–1,000 word essay) about technology addiction. The application deadline is January 30th, 2024.",
    "Link": "https://www.digitalresponsibility.org/technology-addiction-awareness-scholarship",
    "Deadline has passed": "January 30"
  },
  {
    "Scholarship Name": "Bigfuture Scholarship",
    "Member": "Jason Chu",
    "Info": "The Bigfuture Scholarship, hosted by the College Board, provides monthly scholarship drawings for 2024 seniors who add three scholarships via Bigfuture’s scholarship search system. Scholarships range from $500 up to $40,000. This program ends in February of your senior year. The drawings for these scholarships happen on the first day of every month, meaning that there is a rolling deadline for the end of every month. Low-income students can qualify for extra entries and additional financial resources. All seniors are recommended to apply, as the application is simply adding three scholarships to your Bigfuture profile. There are no essays or phases for this scholarship.",
    "Link": "https://bigfuture.collegeboard.org/pay-for-college/bigfuture-scholarships/scholarship-details/start-your-scholarship-list",
    "Deadline has passed": "End of Month"
  },
  {
    "Scholarship Name": "Taco Bell Live Más Scholarship",
    "Member": "Kate Bondarenko",
    "Info": "Students at least 16 years old planning to enroll in a school after high school should submit a 30 second - 2 minute video addressing their passion, how they’re pursuing it, how they’re using it to make positive change, and how their education is helping them do that. In terms of deadlines, the website says that their first deadline for the 2022 cycle was in January, I don’t think they’ve updated their website for this year. The scholarship is $25,000.",
    "Link": "https://www.tacobellfoundation.org/live-mas-scholarship/",
    "Deadline has passed": "January"
  },
  {
    "Scholarship Name": "Coca-Cola Scholars",
    "Member": "Snigdho Somprity",
    "Info": "",
    "Link": "https://bigfuture.collegeboard.org/scholarships/coca-cola-scholars-foundation-scholarship-program",
    "Deadline has passed": ""
  },
  {
    "Scholarship Name": "Amazon Future Engineers Scholarship",
    "Member": "Elaine Huang",
    "Info": "High school students planning on receiving a bachelor’s in computer science or engineering can earn $40,000 for college and internship opportunities at Amazon. 2.3+ GPA and financial need required. Short responses, a teacher recommendation, transcripts, and the IRS 1040 form is required. Due December 15th 2023. You’ll be notified of results by May 15.",
    "Link": "https://scholarshipamerica.org/amazonfutureengineer/",
    "Deadline has passed": "December 15"
  },
  {
    "Scholarship Name": "Sallie Mae Scholarship",
    "Member": "Raymond W",
    "Info": "The Sallie Mae Bank is offering $2,000 scholarships every month to help pay for higher education. High school seniors are recommended to apply. There are no tricks or hidden clauses for this scholarship, it is a simple no-essay scholarship. The scholarship runs on a rolling deadline with deadlines usually falling at the end of every month.",
    "Link": "",
    "Deadline has passed": ""
  },
  {
    "Scholarship Name": "GE-Reagan Foundation Scholarship Program",
    "Member": "Shreya Das",
    "Info": "The GE-Reagan Scholarship is a prestigious award for high school seniors in the United States, offered by the Ronald Reagan Presidential Foundation and Institute. It recognizes students who demonstrate exceptional leadership, academic excellence, and a commitment to the values of integrity and citizenship. Multiple awards and renewable scholarships are offered through this program, with upwards to $10,000 per year in value. Candidates for this program must maintain a minimum 3.0 GPA and follow through the program with essays and recommendation letters. Deadline for application: January 5th",
    "Link": "",
    "Deadline has passed": ""
  },
  {
    "Scholarship Name": "Appily Easy Money Scholarship",
    "Member": "Karen Chen",
    "Info": "Open to any US residents 13 years old or older. Applicants will answer a short questionnaire about GPA, graduation date, prospective colleges, demographic, etc. There is no essay. A winner is randomly chosen to win $1,000 each month.",
    "Link": "",
    "Deadline has passed": ""
  },
  {
    "Scholarship Name": "Greenhouse Scholarship",
    "Member": "Elaine H",
    "Info": "The Greenhouse Scholarship offers $5,000 a year to winners, plus enrollment in growth and development themed programs. Applicants must be high school seniors, low-income, and live in one of 5 states (New York is included) and have a minimum 3.5 GPA. Round 1, Nov. 21: A short response. Round 2, Dec. 1: Essay and 2 rec letters. Round 3, Jan 24: A short video. Round 4, Apr. 4: Scheduled interview.",
    "Link": "",
    "Deadline has passed": ""
  },
  {
    "Scholarship Name": "Truman Scholarship",
    "Member": "Andrew-Rafael Said",
    "Info": "The Truman Scholarship supports those who are committed to public service. They select 65 people from 800 each year . There is no minimum gpa to apply but there is an essay required. Students must also have  teacher recommendations. The scholarship is nation wide and applies to every major",
    "Link": "",
    "Deadline has passed": ""
  },
  {
    "Scholarship Name": "Horatio Alger Patricia Cole Scholarship",
    "Member": "Snigdho Somprity",
    "Info": "*This scholarship opens on December 1st, 2023. \n\nThe Patricia Cole Scholarship Program is funded by Association Friend of Distinction Patricia Cole. It’s awarded to current high school seniors who exhibit a strong desire to pursue and complete a bachelor’s degree in business or STEM (science, technology, engineering, or mathematics). All applicants must have a grade point average (GPA) of 2.0. The scholarship grants 6 awards that are worth $12,500 each.",
    "Link": "",
    "Deadline has passed": ""
  }
]
